# coding: utf8
#freelib bot
bot_name ="@****_bot"
token ="****TOKEN************"
url = "https://****URL*****"
#auth =None
auth =("login", "pass")
my_bot=0
day_limit_download =200
day_limit_search =1000
channel1_chatid =-1111111111 # your chat-id
admin_list =[1111,] # Your unique telegram-id

abbreviation_dict ={"полное":"полн.","том":"т.","коллектив":"колл.","собрание":"собр.","сочинений":"соч.",
"первый":"1-й","второй":"2-й","третий":"3-й","четвертый":"4-й","пятый":"5-й",
"шестой":"6-й","седьмой":"7-й","восьмой":"8-й","девятый":"9-й","десятый":"10-й",
"литература":"лит-ра","литературы":"лит-ры","стихотворения":"стих-я",
"государства":"гос-ва","авторский":"авт-й", "рассказы ":"р-зы","сборник":"сбор."}